In [1]:
import pandas as pd
import numpy as np

# Covert String to numbers

In [2]:
df = pd.DataFrame({'col_1':['9','8','3'],'col_2':['7','6','2'],'col_3':['5','1','4']})
df

  col_1 col_2 col_3
0     9     7     5
1     8     6     1
2     3     2     4

In [3]:
df.dtypes #To find the datatypes

col_1    object
col_2    object
col_3    object
dtype: object

In [4]:
df= df.astype('int')

In [5]:
df.dtypes

col_1    int32
col_2    int32
col_3    int32
dtype: object

In [6]:
#if all the values are different wrt columns
df = pd.DataFrame({'col_1':['9','4','3'],'col_2':['4','1','5'],'col_3':['2.2','6.5','-']})
df

  col_1 col_2 col_3
0     9     4   2.2
1     4     1   6.5
2     3     5     -

In [7]:
# find the datatype
# Convert the datatypes as required
# Fill the errorneous data with Nan

In [8]:
df.dtypes

col_1    object
col_2    object
col_3    object
dtype: object

In [9]:
df.dtypes

col_1    object
col_2    object
col_3    object
dtype: object

In [10]:
df.astype({'col_1':'int','col_2':'int'}).dtypes

col_1     int32
col_2     int32
col_3    object
dtype: object

In [11]:
pd.to_numeric(df.col_3,errors='coerce')

0    2.2
1    6.5
2    NaN
Name: col_3, dtype: float64

In [12]:
df = df.apply(pd.to_numeric,errors='coerce').fillna(0) # To fill the Nan value
df

   col_1  col_2  col_3
0      9      4    2.2
1      4      1    6.5
2      3      5    0.0

In [13]:
df.dtypes

col_1      int64
col_2      int64
col_3    float64
dtype: object

# Create a dataframe from a clipboard

In [14]:
df = pd.read_clipboard() # Create the excel sheet in ur desktop and copy to the clipboard
df

Empty DataFrame
Columns: [df.name.str.split(', ',, expand=True)]
Index: []

In [15]:
df.dtypes

df.name.str.split('    object
',                     object
expand=True)           object
dtype: object

In [16]:
df = pd.read_clipboard() 
df

Empty DataFrame
Columns: [df.name.str.split(', ',, expand=True)]
Index: []

In [17]:
df.index # To find the index value
df.columns  # To find the columns

Index(['df.name.str.split('', '',', 'expand=True)'], dtype='object')

# Split the DataFrame into random subsets

In [18]:
cars=pd.read_csv("mtcars.csv")
cars.head()

,car_model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

In [19]:
cars.shape

(32, 12)

In [20]:
cars_1=cars.sample(frac=0.75)
cars_1.shape

(24, 12)

In [21]:
cars_2=cars.drop(cars_1.index)
cars_2.shape

(8, 12)

In [22]:
cars_1.index.sort_values()

Int64Index([ 0,  1,  2,  3,  4,  5,  7,  9, 11, 12, 14, 15, 18, 19, 20, 21, 23,
            24, 25, 26, 27, 29, 30, 31],
           dtype='int64')

In [23]:
cars_2.index.sort_values()

Int64Index([6, 8, 10, 13, 16, 17, 22, 28], dtype='int64')

# Split the string into multiple columns

In [24]:
df = pd.DataFrame({'name':['Narendra Modi','Raghul Gandhi','Swami Vivekananda','Baghat Singh'],'location':['Gujarat','Delhi','Bengal','Punjab']})
df

                name location
0      Narendra Modi  Gujarat
1      Raghul Gandhi    Delhi
2  Swami Vivekananda   Bengal
3       Baghat Singh   Punjab

In [25]:
#Split the name and put it back to the DataFrame

In [26]:
#df.name.str.split('',expand=True) # This condition is to split the name
df.name.str.split(' ', expand=True)

          0            1
0  Narendra         Modi
1    Raghul       Gandhi
2     Swami  Vivekananda
3    Baghat        Singh

In [27]:
df[['first_name','last_name']]=df.name.str.split(' ', expand=True)
df

                name location first_name    last_name
0      Narendra Modi  Gujarat   Narendra         Modi
1      Raghul Gandhi    Delhi     Raghul       Gandhi
2  Swami Vivekananda   Bengal      Swami  Vivekananda
3       Baghat Singh   Punjab     Baghat        Singh

# Merge

In [28]:
data1 = pd.DataFrame({'Name':['Alex','Amy','Allen','Alice','Archie'],'Math':[22,32,35,65,77]})
data2 = pd.DataFrame({'Name':['Alex','Amy','Allen','Alice','Archie'],'Science':[25,33,36,96,80]})
data1

     Name  Math
0    Alex    22
1     Amy    32
2   Allen    35
3   Alice    65
4  Archie    77

In [29]:
# Merge two dataframes on a key
pd.merge(data1,data2,on='Name') # This is called inner join

     Name  Math  Science
0    Alex    22       25
1     Amy    32       33
2   Allen    35       36
3   Alice    65       96
4  Archie    77       80

In [30]:
data1 = pd.DataFrame({'Name':['Alex','Amy','Allen','Alice','Archie','Krish'],'Math':[22,32,35,65,77,90]})
data2 = pd.DataFrame({'Name':['Alex','Amy','Allen','Alice','Archie'],'Science':[25,33,36,96,80]})
data2

     Name  Science
0    Alex       25
1     Amy       33
2   Allen       36
3   Alice       96
4  Archie       80

In [31]:
pd.merge(data1,data2,on='Name') # inner join like intersection on sets

     Name  Math  Science
0    Alex    22       25
1     Amy    32       33
2   Allen    35       36
3   Alice    65       96
4  Archie    77       80

In [32]:
pd.merge(data1,data2,on='Name',how='outer') #union is both

     Name  Math  Science
0    Alex    22     25.0
1     Amy    32     33.0
2   Allen    35     36.0
3   Alice    65     96.0
4  Archie    77     80.0
5   Krish    90      NaN

In [33]:
pd.merge(data1,data2,on='Name',how='left') # left and common

     Name  Math  Science
0    Alex    22     25.0
1     Amy    32     33.0
2   Allen    35     36.0
3   Alice    65     96.0
4  Archie    77     80.0
5   Krish    90      NaN

In [34]:
pd.merge(data1,data2,on='Name',how='right') #right and common

     Name  Math  Science
0    Alex    22       25
1     Amy    32       33
2   Allen    35       36
3   Alice    65       96
4  Archie    77       80

In [35]:
pd.merge(data1,data2,on='Name',how='left',indicator=True)

     Name  Math  Science     _merge
0    Alex    22     25.0       both
1     Amy    32     33.0       both
2   Allen    35     36.0       both
3   Alice    65     96.0       both
4  Archie    77     80.0       both
5   Krish    90      NaN  left_only

In [37]:
pd.__version__

'0.25.1'